Revit 2027 API
ExportLinetypeTable.GetValues Method
 Returns all the values stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExportLinetypeInfo> GetValues()
Public Function GetValues As IList(Of ExportLinetypeInfo)
public:
IList<ExportLinetypeInfo^>^ GetValues()
member GetValues : unit -> IList<ExportLinetypeInfo>
Return Value
IList<ExportLinetypeInfo>
 The info.
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace